In [1]:
import pandas

In [2]:
my_friends = [
    {
        'name': 'Jon',
        'age': 23,
        'vocation': 'nightwatch'
    },
    {
        'name': 'Gendry',
        'age': 17,
        'vocation': 'blacksmith'
    },
    {
        'name': 'Arya',
        'age': 14,
        'vocation': 'assasin'
    },
    {
        'name': 'Tywin',
        'age': 62,
        'vocation': 'advisor'
    },
    {
        'name': 'Olena',
        'age': 62,
        'vocation': 'advisor'
    },
    {
        'name': 'Jaqen',
        'age': 35,
        'vocation': 'assasin'
    },
    {
        'name': 'Jon',
        'age': 28,
        'vocation': 'coder'
    },
]

In [3]:
print (my_friends)

[{'name': 'Jon', 'age': 23, 'vocation': 'nightwatch'}, {'name': 'Gendry', 'age': 17, 'vocation': 'blacksmith'}, {'name': 'Arya', 'age': 14, 'vocation': 'assasin'}, {'name': 'Tywin', 'age': 62, 'vocation': 'advisor'}, {'name': 'Olena', 'age': 62, 'vocation': 'advisor'}, {'name': 'Jaqen', 'age': 35, 'vocation': 'assasin'}, {'name': 'Jon', 'age': 28, 'vocation': 'coder'}]

In [4]:
friends_df = pandas.DataFrame(my_friends)

In [5]:
friends_df

   age    name    vocation
0   23     Jon  nightwatch
1   17  Gendry  blacksmith
2   14    Arya     assasin
3   62   Tywin     advisor
4   62   Olena     advisor
5   35   Jaqen     assasin
6   28     Jon       coder

In [6]:
friends_df.T

                   0           1        2        3        4        5      6
age               23          17       14       62       62       35     28
name             Jon      Gendry     Arya    Tywin    Olena    Jaqen    Jon
vocation  nightwatch  blacksmith  assasin  advisor  advisor  assasin  coder

In [7]:
friends_df.to_dict('records')

[{'age': 23, 'name': 'Jon', 'vocation': 'nightwatch'},
 {'age': 17, 'name': 'Gendry', 'vocation': 'blacksmith'},
 {'age': 14, 'name': 'Arya', 'vocation': 'assasin'},
 {'age': 62, 'name': 'Tywin', 'vocation': 'advisor'},
 {'age': 62, 'name': 'Olena', 'vocation': 'advisor'},
 {'age': 35, 'name': 'Jaqen', 'vocation': 'assasin'},
 {'age': 28, 'name': 'Jon', 'vocation': 'coder'}]

In [8]:
friends_df.to_dict('list')

{'age': [23, 17, 14, 62, 62, 35, 28],
 'name': ['Jon', 'Gendry', 'Arya', 'Tywin', 'Olena', 'Jaqen', 'Jon'],
 'vocation': ['nightwatch',
  'blacksmith',
  'assasin',
  'advisor',
  'advisor',
  'assasin',
  'coder']}

In [9]:
sorted_friends = friends_df.sort_values('age')
sorted_friends

   age    name    vocation
2   14    Arya     assasin
1   17  Gendry  blacksmith
0   23     Jon  nightwatch
6   28     Jon       coder
5   35   Jaqen     assasin
3   62   Tywin     advisor
4   62   Olena     advisor

In [10]:
friends_df

   age    name    vocation
0   23     Jon  nightwatch
1   17  Gendry  blacksmith
2   14    Arya     assasin
3   62   Tywin     advisor
4   62   Olena     advisor
5   35   Jaqen     assasin
6   28     Jon       coder

In [11]:
friends_df.sort_values('age', ascending=False)

   age    name    vocation
3   62   Tywin     advisor
4   62   Olena     advisor
5   35   Jaqen     assasin
6   28     Jon       coder
0   23     Jon  nightwatch
1   17  Gendry  blacksmith
2   14    Arya     assasin

In [12]:
friends_df['age'].mean()

34.42857142857143

In [13]:
friends_df['vocation'].value_counts()

advisor       2
assasin       2
nightwatch    1
coder         1
blacksmith    1
Name: vocation, dtype: int64

In [14]:
friends_df.max()

age                 62
name             Tywin
vocation    nightwatch
dtype: object

In [15]:
friends_df.max()['name']

'Tywin'

In [16]:
friends_df.min()['name']

'Arya'

In [17]:
friends_df

   age    name    vocation
0   23     Jon  nightwatch
1   17  Gendry  blacksmith
2   14    Arya     assasin
3   62   Tywin     advisor
4   62   Olena     advisor
5   35   Jaqen     assasin
6   28     Jon       coder

In [18]:
friends_df['vocation'] == 'assasin'

0    False
1    False
2     True
3    False
4    False
5     True
6    False
Name: vocation, dtype: bool

In [19]:
friends_df[friends_df['vocation'] == 'assasin']

   age   name vocation
2   14   Arya  assasin
5   35  Jaqen  assasin

In [20]:
friends_df['age'] > 20

0     True
1    False
2    False
3     True
4     True
5     True
6     True
Name: age, dtype: bool

In [21]:
friends_df[friends_df['age'] > 20]

   age   name    vocation
0   23    Jon  nightwatch
3   62  Tywin     advisor
4   62  Olena     advisor
5   35  Jaqen     assasin
6   28    Jon       coder

In [22]:
(friends_df['age'] > 20) & (friends_df['vocation'] != 'nightwatch')

0    False
1    False
2    False
3     True
4     True
5     True
6     True
dtype: bool

In [23]:
friends_df[(friends_df['age'] > 20) & (friends_df['vocation'] != 'nightwatch')]

   age   name vocation
3   62  Tywin  advisor
4   62  Olena  advisor
5   35  Jaqen  assasin
6   28    Jon    coder

In [24]:
filter1 = friends_df['age'] > 20
filter1

0     True
1    False
2    False
3     True
4     True
5     True
6     True
Name: age, dtype: bool

In [25]:
filter2 = friends_df['vocation'] != 'nightwatch'
filter2

0    False
1     True
2     True
3     True
4     True
5     True
6     True
Name: vocation, dtype: bool

In [26]:
friends_df[filter1 & filter2]

   age   name vocation
3   62  Tywin  advisor
4   62  Olena  advisor
5   35  Jaqen  assasin
6   28    Jon    coder

In [27]:
friends_df[filter2]

   age    name    vocation
1   17  Gendry  blacksmith
2   14    Arya     assasin
3   62   Tywin     advisor
4   62   Olena     advisor
5   35   Jaqen     assasin
6   28     Jon       coder

In [28]:
friends_df[filter1]

   age   name    vocation
0   23    Jon  nightwatch
3   62  Tywin     advisor
4   62  Olena     advisor
5   35  Jaqen     assasin
6   28    Jon       coder